[{
    "nome": "ALESSIA AURIEMMA CITARELLA",
    "titolo": "Ricercatore",
    "dipartimento": "Dipartimento di Informatica/DI",
    "telefono": "Null",
    "email": "aauriemmacitarella@unisa.it",
    "ufficio": "Null",
    "pagina_personale": "Null",
    "orari_di_ricevimento": [
        {
            "day": "Null",
            "timings": "Null",
            "location": "Null"
        }
    ],
    "corsi": [],
    "url": "https://docenti.unisa.it/038541/home",
    "url_immagine_professore": "https://docenti.unisa.it/uploads/rescue/foto/default_f.jpg",
    "error": false
},{
    "nome": "Marcella ANSELMO",
    "titolo": "Professore Associato",
    "dipartimento": "Dipartimento di Informatica/DI",
    "telefono": "089 969712",
    "email": "manselmo@unisa.it",
    "ufficio": "Null",
    "pagina_personale": "http://www.di.unisa.it/~anselmo/",
    "orari_di_ricevimento": [
        {
            "day": "Giovedì",
            "timings": "9:30 - 11:00",
            "location": "Null"
        },
        {
            "day": "Venerdì",
            "timings": "9:30 - 11:00",
            "location": "Null"
        }
    ],
    "corsi": [
        {
            "name": "ELEMENTI DI TEORIA DELLA COMPUTAZIONE",
            "code": "cod. 0512100018",
            "details_link": "https://docenti.unisa.it/001367/didattica?anno=2023&id=507545",
            "scheda": {
                "Obiettivi": "CONOSCENZA E CAPACITÀ DI COMPRENSIONE\nOBIETTIVO DELL'INSEGNAMENTO È L’ACQUISIZIONE DA PARTE DELLO STUDENTE:\n•DEL CONCETTO DI MODELLO ASTRATTO DI COMPUTAZIONE\n•DELLA DISTINZIONE TRA I CONCETTI DI COMPUTABILE E NON COMPUTABILE\n•DEL CONCETTO DI COMPLESSITÀ E DELLA DISTINZIONE TRA PROBLEMA TRATTABILE E INTRATTABILE\n\nCAPACITÀ DI APPLICARE CONOSCENZA E COMPRENSIONE\nANALIZZARE IL COMPORTAMENTO DI AUTOMI FINITI E MACCHINE DI TURING. PROGETTARE SEMPLICI MODELLI DI COMPUTAZIONE PER LA SOLUZIONE DI PROBLEMI DI DECISIONE (PROBLEMI CON RISPOSTA SÌ/NO).",
                "Prerequisiti": "MATEMATICA DISCRETA: INSIEMI, OPERAZIONI SU INSIEMI, CARDINALITÀ, PRODOTTO CARTESIANO, FUNZIONI\n• LOGICA: PREDICATI E QUANTIFICATORI. METODI E STRATEGIE DI DIMOSTRAZIONE\n• ALGORITMI: NOTAZIONI ASINTOTICHE",
                "Contenuti": "MODELLI DI COMPUTAZIONE: AUTOMI FINITI DETERMINISTICI E NON DETERMINISTICI. ESPRESSIONI REGOLARI. PROPRIETÀ DI CHIUSURA DEI LINGUAGGI REGOLARI. TEOREMA DI KLEENE. PUMPING LEMMA PER I LINGUAGGI REGOLARI. [24 ORE] MACCHINA DI TURING DETERMINISTICA A NASTRO SINGOLO. IL LINGUAGGIO RICONOSCIUTO DA UNA MACCHINA DI TURING. [12 ORE] \n• IL CONCETTO DI COMPUTABILITÀ: FUNZIONI CALCOLABILI, VARIANTI DI MACCHINE DI TURING E LORO EQUIVALENZA, LINGUAGGI DECIDIBILI E LINGUAGGI TURING RICONOSCIBILI. LINGUAGGI DECIDIBILI E LINGUAGGI INDECIDIBILI. IL PROBLEMA DELLA FERMATA. RIDUZIONI, TEOREMA DI RICE. [20 ORE] \n• IL CONCETTO DI COMPLESSITÀ: MISURE DI COMPLESSITÀ: COMPLESSITÀ IN TEMPO DETERMINISTICO E NON DETERMINISTICO. RELAZIONI DI COMPLESSITÀ TRA VARIANTI DI MACCHINE DI TURING. LA CLASSE P. LA CLASSE NP. RIDUCIBILITÀ IN TEMPO POLINOMIALE. DEFINIZIONE DI NP-COMPLETEZZA. RIDUZIONI POLINOMIALI. ESEMPI DI LINGUAGGI NP-COMPLETI. [16 ORE]",
                "Metodi Didattici": "LEZIONI FRONTALI TESE A TRASFERIRE I CONCETTI ELENCATI NELLA SEZIONE “CONTENUTI DEL CORSO”. LE LEZIONI SONO COMPRENSIVE DI ESERCITAZIONI IN CUI VERRANNO PRESENTATI ESEMPI DI APPLICAZIONI DI TALI CONCETTI, ALLO SCOPO DI RENDERE LO STUDENTE IN GRADO DI APPLICARE LA CONOSCENZA ACQUISITA.",
                "Verifica dell'apprendimento": "L'ESAME PREVEDE LO SVOLGIMENTO DI UNA PROVA SCRITTA DI DUE ORE. LA PROVA SCRITTA POTRÀ ESSERE SOSTITUITA DAL SUPERAMENTO DI DUE PROVE INTERCORSO. SE DOVESSERO PERDURARE LE CONDIZIONI DI EMERGENZA COVID-19 E LE RESTRIZIONI AD ESSE CONNESSE, LE SUDDETTE PROVE POTREBBERO ESSERE SVOLTE IN MODALITÀ TELEMATICA A DISTANZA.\nLA PROVA SCRITTA CONSISTE DI DOMANDE SU ARGOMENTI DEL CORSO ED ESERCIZI LA CUI SOLUZIONE PREVEDE L’APPLICAZIONE DI TALI ARGOMENTI.\n\nLA PROVA È TESA A VALUTARE IL LIVELLO DELLE CONOSCENZE TEORICHE E DELLA CAPACITÀ DI APPLICARE TALI CONOSCENZE, L’AUTONOMIA DI ANALISI E GIUDIZIO, NONCHÉ LE CAPACITÀ ESPOSITIVE DELL’ALLIEVO.\n\nIL LIVELLO DI VALUTAZIONE DELLE PROVE TIENE CONTO DELLA CORRETTEZZA DEI METODI UTILIZZATI, DELLA COMPLETEZZA ED ESATTEZZA DELLE RISPOSTE, NONCHÉ DELLA CHIAREZZA NELLA PRESENTAZIONE.\n\nIL LIVELLO DI VALUTAZIONE MINIMO (18) È ATTRIBUITO QUANDO LO STUDENTE DIMOSTRA INCERTEZZE NELL’APPLICAZIONE DEI METODI STUDIATI E HA UNA LIMITATA CONOSCENZA DEI MODELLI DI COMPUTAZIONE E DELLA COMPLESSITÀ COMPUTAZIONALE.\nIL LIVELLO MASSIMO (30) È ATTRIBUITO QUANDO LO STUDENTE DIMOSTRA UNA CONOSCENZA COMPLETA E APPROFONDITA DEI CONCETTI E DEI METODI DELLA TEORIA DELLA COMPUTAZIONE, È IN GRADO DI RISOLVERE I PROBLEMI PROPOSTI PERVENENDO IN MODO EFFICIENTE ED ACCURATO ALLA SOLUZIONE E MOSTRA CAPACITÀ DI COLLEGARE TRA LORO CONCETTI DIVERSI.\nLA LODE È ATTRIBUITA QUANDO IL CANDIDATO DIMOSTRA SIGNIFICATIVA PADRONANZA DEI CONTENUTI TEORICI ED OPERATIVI E MOSTRA DI SAPER PRESENTARE GLI ARGOMENTI CON NOTEVOLE PROPRIETÀ DI LINGUAGGIO E CAPACITÀ DI ELABORAZIONE AUTONOMA.",
                "Testi": "• M. SIPSER, INTRODUZIONE ALLA TEORIA DELLA COMPUTAZIONE, APOGEO, 2016\n• J. HOPCROFT, R. MOTWANI, J. ULLMAN, AUTOMI, LINGUAGGI E CALCOLABILITÀ, ADDISON WESLEY PEARSON EDUCATION ITALIA S.R.L, TERZA EDIZIONE, 2009.\n\nULTERIORI MATERIALI E SUPPORTI NECESSARI PER AFFRONTARE LO STUDIO E LA GESTIONE DELLA PROVA DI VERIFICA POTRANNO ESSERE FORNITI TRAMITE LA PIATTAFORMA E-LEARNING ALL’INDIRIZZO HTTP://ELEARNING.INFORMATICA.UNISA.IT/ E LE PAGINE WEB DEI DOCENTI\n\nHTTPS://DOCENTI.UNISA.IT/001367/HOME\n\nHTTPS://DOCENTI.UNISA.IT/023039/HOME",
                "Altre Informazioni": "ULTERIORI MATERIALI E SUPPORTI NECESSARI PER AFFRONTARE LO STUDIO E LA GESTIONE DELLA PROVA DI VERIFICA POTRANNO ESSERE FORNITI TRAMITE LA PIATTAFORMA E-LEARNING ALL’INDIRIZZO HTTP://ELEARNING.INFORMATICA.UNISA.IT/ E LE PAGINE WEB DEI DOCENTI\n\nHTTPS://DOCENTI.UNISA.IT/001367/HOME\nHTTPS://DOCENTI.UNISA.IT/023039/HOME"
            },
            "orari_lezioni_link": "https://docenti.unisa.it/001367/didattica/orari?include=attivita&attivita=EC2023*MODULO_3*RESTO_2*S2*S2*76505*507545"
        },
        {
            "name": "PROGETTAZIONE DI ALGORITMI",
            "code": "cod. 0512100043",
            "details_link": "https://docenti.unisa.it/001367/didattica?anno=2023&id=509831",
            "scheda": {
                "Obiettivi": "L’INSEGNAMENTO SI PREFIGGE I SEGUENTI OBIETTIVI:\n- FORNIRE ALLO STUDENTE METODI E CONOSCENZE ATTI AL PROGETTO DI ALGORITMI EFFICIENTI\n- FORNIRE STRUMENTI PER L’ANALISI DELLE RISORSE (SPAZIO E TEMPO) UTILIZZATE DA ALGORITMI\n- FORNIRE UN CATALOGO DEI PIÙ NOTI ED EFFICIENTI ALGORITMI PER PROBLEMI COMPUTAZIONALI DI BASE (ORDINAMENTO, RICERCA, OTTIMIZZAZIONE DI RISORSE, ETC.)\n\nCAPACITÀ DI APPLICARE CONOSCENZA E COMPRENSIONE\n\nL’INSEGNAMENTO HA COME OBIETTIVO QUELLO DI RENDERE LO STUDENTE CAPACE DI ASTRARRE MODELLI E PROBLEMI ALGORITMICI FORMALI DA PROBLEMI COMPUTAZIONALI CONCRETI, E DI PROGETTARE PER ESSI SOLUZIONI ALGORITMICHE EFFICIENTI.",
                "Prerequisiti": "LO STUDENTE DOVREBBE AVERE ACQUISITO LE NOZIONI DI MATEMATICA INSEGNATE NEL PRECEDENTE ANNO ACCADEMICO E LA CAPACITÀ DI SVILUPPARE RAGIONAMENTI DI TIPO LOGICO. DOVREBBE ALTRESÌ AVER APPRESO I CONCETTI DI BASE DI UN INSEGNAMENTO INTRODUTTIVO ALLE STRUTTURE DATI.",
                "Contenuti": "ORE DI LEZIONI FRONTALI: 48\nORE DI ESERCITAZIONI: 24\n\n1.INTRODUZIONE ALLE NOTAZIONI ASINTOTICHE O GRANDE, OMEGA, TETA E\nLORO APPLICAZIONI ALL'ANALISI ASINTOTICA DEGLI ALGORITMI (4 ORE TEORIA + 2 DI ESERCITAZIONI)\n2.STUDIO DELL'EQUAZIONI DI RICORRENZA PER L'ANALISI DELLA COMPLESSITÀ DI\nALGORITMI RICORSIVI E DERIVAZIONE DI METODI PER LA LORO SOLUZIONE (2 ORE TEORIA + 2 DI ESERCITAZIONI)\n3.STUDIO DELLA TECNICA DIVIDE ET IMPERA PER LA PROGETTAZIONE DI ALGORITMI E RELATIVI\nESEMPI DI APPLICAZIONE (10 ORE TEORIA + 4 DI ESERCITAZIONI)\n4.STUDIO DELLA TECNICA PROGRAMMAZIONE DINAMICA PER LA PROGETTAZIONE DI ALGORITMI \nE RELATIVI ESEMPI DI APPLICAZIONE (10 ORE TEORIA + 4 DI ESERCITAZIONI).\n5.STUDIO DELLA TECNICA GREEDY PER LA PROGETTAZIONE DI ALGORITMI E RELATIVI ESEMPI DI\nAPPLICAZIONE (10 ORE TEORIA + 4 DI ESERCITAZIONI).\n6.GRAFI ED ALGORITMI SU GRAFI. VISITA IN AMPIEZZA E VISITA IN PROFONDITÀ DI GRAFI E\nLORO APPLICAZIONI. GRAFI DIRETTI ACICLICI ED ORDINAMENTO TOPOLOGICO. ALGORITMI PER IL\nCALCOLO DI CAMMINI DI COSTO MINIMO IN GRAFI CON COSTI SU ARCHI. ALGORITMI PER IL\nCALCOLO DI ALBERI RICOPRENTI DI COSTO MINIMO IN GRAFI CON COSTI SU ARCHI\n(8 ORE TEORIA + 6 DI ESERCITAZIONI).\n7. ALGORITMI INTELLIGENTI DI RICERCA ESAUSTIVA: BACKTRACKING, BRANCH-AND-BOUND E RELATIVI\nESEMPI DI APPLICAZIONE. (4 ORE TEORIA + 2 DI ESERCITAZIONI).",
                "Metodi Didattici": "L’INSEGNAMENTO PREVEDE UNA PARTE (48 ORE) DI LEZIONI FRONTALI DI CARATTERE TEORICO/METODOLOGICO FINALIZZATE ALL'APPRENDIMENTO DELLE TECNICHE DI BASE PER IL PROGETTO ED ANALISI DI ALGORITMI, E UNA PARTE (24 ORE) DI LEZIONI FRONTALI DI TIPO ESERCITATIVO IN CUI SI ILLUSTRERÀ, CON ABBONDANZA DI ESEMPI, IN CHE MODO LE METODOLOGIE ACQUISITE POSSANO ESSERE UTILIZZATE AL FINE DI RISOLVERE PROBLEMI ALGORITMICI DI INTERESSE PRATICO.\nLA FREQUENZA ALLE LEZIONI NON È OBBLIGATORIA, MA CONSIGLIATA.",
                "Verifica dell'apprendimento": "IL RAGGIUNGIMENTO DEGLI OBIETTIVI DELL’INSEGNAMENTO È CERTIFICATO MEDIANTE IL SUPERAMENTO DI UN ESAME CON VALUTAZIONE IN TRENTESIMI. L'ESAME PREVEDE UNA PROVA SCRITTA ED UNA PROVA ORALE. LA PROVA SCRITTA POTRÀ ESSERE SOSTITUITA DA DUE PROVE INTERCORSO, LA PRIMA A CIRCA METÀ DEL CORSO E LA SECONDA ALLA FINE DELLO STESSO. LA PROVA SCRITTA HA SOLITAMENTE DURATA VARIABILE TRA 90 E 120 MINUTI. ESSA SI SVOLGE IN DATA PRECEDENTE ALLA PROVA ORALE E LA SI CONSIDERA SUPERATA CON IL RAGGIUNGIMENTO DEL PUNTEGGIO MINIMO PRESTABILITO. LE PROVE SCRITTE SARANNO PARTICOLARMENTE PROGETTATE PER VERIFICARE IL LIVELLO DI ACQUISIZIONE, DA PARTE DELLO STUDENTE, DELLE CAPACITÀ DI APPLICARE LE METODOLOGIE PER IL PROGETTO ED ANALISI DI ALGORITMI A SEMPLICI PROBLEMI CONCRETI. LA PROVA ORALE CONSISTE IN UN COLLOQUIO CON DOMANDE E DISCUSSIONE SULLE METODOLOGIE DI PROGETTO DI ALGORITMI STUDIATE DURANTE IL CORSO. ESSA È FINALIZZATA AD ACCERTARE IL LIVELLO DI CONOSCENZA E DI COMPRENSIONE RAGGIUNTO DALLO STUDENTE, AD ACCERTARE LA CAPACITÀ DI ESPOSIZIONE DI ORGANIZZAZIONE DELL'ESPOSIZIONE SUGLI STESSI ARGOMENTI A CONTENUTO TEORICO. LA VOTAZIONE FINALE È, DI NORMA, LA MEDIA DELLE VALUTAZIONI DELLA PROVA SCRITTA E DELLA PROVA ORALE.",
                "Testi": "LIBRI DI TESTO:\nKLEINBERG, TARDOS. ALGORITHM DESIGN. PEARSON ADDISON WESLEY.\nS. DASGUPTA, C.H. PAPADIMITRIOU, AND U.V. VAZIRANI. ALGORITHMS. MCGRAW-HILL\n\nULTERIORI MATERIALI E SUPPORTI NECESSARI PER AFFRONTARE LO STUDIO E LA GESTIONE DELLA PROVA DI VERIFICA POTRANNO ESSERE FORNITI TRAMITE LE PAGINE DEI DOCENTI E/O LA PIATTAFORMA E-LEARNING ALL’INDIRIZZO HTTP://ELEARNING.INFORMATICA.UNISA.IT/.\n\nULTERIORE MATERIALE DIDATTICO DI SUPPORTO (ESERCIZI, TEST PER L’AUTOVALUTAZIONE) SARANNO RESI DISPONIBILI SUI SITI WEB PERSONALI DEI DOCENTI.",
                "Altre Informazioni": "È RAGIONEVOLE SUPPORRE CHE UNA PREPARAZIONE SODDISFACENTE RICHIEDA IN MEDIA 2 ORE DI STUDIO PER CIASCUNA ORA TRASCORSA IN AULA."
            },
            "orari_lezioni_link": "https://docenti.unisa.it/001367/didattica/orari?include=attivita&attivita=EC2023*MODULO_3*RESTO_2*S2*S2*71983*509831"
        }
    ],
    "url": "https://docenti.unisa.it/001367/home",
    "url_immagine_professore": "https://docenti.unisa.it/uploads/rescue/foto/001367.jpg",
    "error": false
},{
    "nome": "Andrea Francesco ABATE",
    "titolo": "Professore Ordinario",
    "dipartimento": "Dipartimento di Informatica/DI",
    "telefono": [
        "089 963313",
        "089 96 3432"
    ],
    "email": "abate@unisa.it",
    "ufficio": "Campus di Fisciano, Edificio F2, Piano Primo, stanza 092 (U.FINV-12B.P01.092)",
    "pagina_personale": "Null",
    "orari_di_ricevimento": [
        {
            "day": "Martedì",
            "timings": "15:30 - 17:00",
            "location": "Studio docente"
        },
        {
            "day": "Giovedì",
            "timings": "15:30 - 17:00",
            "location": "Studio docente"
        }
    ],
    "corsi": [
        {
            "name": "GRAFICA ED INTERATTIVITA'",
            "code": "cod. 0512100049",
            "details_link": "https://docenti.unisa.it/004620/didattica?anno=2023&id=509870",
            "scheda": {
                "Obiettivi": "CONOSCENZA E CAPACITÀ DI COMPRENSIONE\nLO STUDENTE DOVRÀ AVERE CONOSCENZA DI BASE E AVANZATA SU:\nTECNICHE DI COMPUTER GRAFICA TRIDIMENSIONALE E DI REALTÀ VIRTUALE\nPRINCIPALI TECNICHE DI MODELLAZIONE, ILLUMINAZIONE E RENDERING\nPRINCIPALI FUNZIONALITÀ DEI MOTORI 3D E UNITY\nGLI ALGORITMI ED I METODI COMPUTAZIONALI SU CUI SI BASANO MOLTE DELLE APPLICAZIONI GRAFICHE 3D INTERATTIVE\n\nCAPACITÀ DI APPLICARE CONOSCENZA E COMPRENSIONE\nLO STUDENTE DOVRÀ ESSERE CAPACE DI:\nUSARE MOTORI 3D PER LA REALIZZAZIONE DI SEMPLICI GIOCHI DI ESEMPIO\nDESCRIVERE, PROGETTARE E SVILUPPARE APPLICAZIONI VIRTUALI INTERATTIVE CON PROPRIETÀ DI LINGUAGGIO E CAPACITÀ DI SINTESI",
                "Prerequisiti": "GLI STUDENTI DEVONO AVER ACQUISITO CONOSCENZE DI PROGRAMMAZIONE IN C, PROGRAMMAZIONE ORIENTATA AGLI OGGETTI, UTILIZZO SIGNIFICATIVO DI INTEGRATED DEVELOPMENT ENVIRONMENT E CONCETTI BASILARI DI ANALISI MATEMATICA.",
                "Contenuti": "INTRODUZIONE ALLA COMPUTER GRAFICA 3D (2 ORE)\nFONDAMENTI DI COMPUTER GRAFICA (SPAZIO 3D, PRIMITIVE GEOMETRICHE, TRASFORMAZIONI) (4 ORE)\nMODELLAZIONE SUPERFICIALE (MODELLAZIONE POLIGONALE, SUPERFICI PARAMETRICHE, SUPERFICI DI SUDDIVISIONE, ETC.) (2 ORE)\nEQUAZIONE DELLA RADIANZA (2 ORE)\nLOCAL ILLUMINATION E RAY TRACING (2 ORE)\nCONCETTO DI CAMERA (2 ORE)\nCENNI SULLA PERCEZIONE (2 ORE)\nSTEREOSCOPIA (2 ORE)\nINTERAZIONE APTICA (2 ORE)\nMOTION CAPTURE ( 2 ORE) \nREALTÀ AUMENTATA ( 2 ORE) \nMOTORI 3D E UNITY: INTRODUZIONE AI MOTORI 3D E UNITY (4 ORE)\nCARATTERISTICHE PRINCIPALI DI UNITY (20 ORE)",
                "Metodi Didattici": "LEZIONI FRONTALI ED ESERCITAZIONI.",
                "Verifica dell'apprendimento": "IL RAGGIUNGIMENTO DEGLI OBIETTIVI DELL’INSEGNAMENTO È CERTIFICATO MEDIANTE IL SUPERAMENTO DI UN ESAME CON VALUTAZIONE IN TRENTESIMI. L'ESAME PREVEDE UNA PROVA SCRITTA E UNA PROVA ORALE. \n\nLA PROVA SCRITTA È PROPEDEUTICA ALLA PROVA ORALE E CONSISTE IN UN TEST A RISPOSTA APERTA SU ARGOMENTI DEL PROGRAMMA DI INSEGNAMENTO E SU UNA PROVA PRATICA CON L’AMBIENTE UNITY. LA PROVA SI SVOLGE ANTERIORMENTE ALLA PROVA ORALE E SI CONSIDERA SUPERATA CON IL RAGGIUNGIMENTO DEL PUNTEGGIO MINIMO PRESTABILITO. LA PROVA SCRITTA HA DI NORMA UNA DURATA NON INFERIORE A 120 MINUTI ED È FINALIZZATA A VERIFICARE LA CAPACITÀ DI APPLICARE CORRETTAMENTE LE CONOSCENZE TEORICHE, LA CAPACITÀ DI COMPRENSIONE DELLE PROBLEMATICHE PROPOSTE.\n\nLA PROVA ORALE CONSISTE IN UN COLLOQUIO CON DOMANDE E DISCUSSIONE SUI CONTENUTI TEORICI E METODOLOGICI INDICATI NEL PROGRAMMA DELL’INSEGNAMENTO ED È FINALIZZATA AD ACCERTARE IL LIVELLO DI CONOSCENZA E CAPACITÀ DI COMPRENSIONE RAGGIUNTO DALLO STUDENTE, NONCHÉ A VERIFICARE LA CAPACITÀ DI ESPOSIZIONE RICORRENDO ALLA TERMINOLOGIA APPROPRIATA E LA CAPACITÀ DI ORGANIZZAZIONE AUTONOMA DELL'ESPOSIZIONE SUGLI STESSI ARGOMENTI A CONTENUTO TEORICO.",
                "Testi": "DISPENSE DEL CORSO (A CURA DEL DOCENTE)\nFOLEY, VAN DAM, FEINER, HUGHES: COMPUTER GRAPHICS – PRINCIPLES AND PRACTICE. ADDISON WESLEY",
                "Altre Informazioni": "INDIRIZZO DI POSTA ELETTRONICA DEI DOCENTI:\nABATE@UNISA.IT\nINDIRIZZI DEL SITO WEB DEL DOCENTE:\nHTTP://DOCENTI.UNISA.IT/ANDREAFRANCESCO.ABATE"
            },
            "orari_lezioni_link": "https://docenti.unisa.it/004620/didattica/orari?include=attivita&attivita=EC2023*N0*N0*S2*S2*67284*509870"
        },
        {
            "name": "INFORMATION VISUALIZATION",
            "code": "cod. 0522500098",
            "details_link": "https://docenti.unisa.it/004620/didattica?anno=2023&id=511681",
            "scheda": {
                "Obiettivi": "CONOSCENZA E CAPACITÀ DI COMPRENSIONE\nGLI STUDENTI ACQUISIRANNO:\nCONOSCENZA SU TECNICHE DI COMPUTER GRAFICA TRIDIMENSIONALE E DI REALTÀ VIRTUALE CON PARTICOLARE RIFERIMENTO ALLE PRINCIPALI TECNICHE DI MODELLAZIONE, ILLUMINAZIONE, ANIMAZIONE E RENDERING, FINALIZZATE ALLA REALIZZAZIONE DI CONTENT INTERATTIVO E NON INTERATTIVO, REAL TIME E NON REAL TIME, MONOSCOPICO E STEREOSCOPICO\nCONOSCENZA DEI PRINCIPI DELLA RAPPRESENTAZIONE VISUALE DI INFORMAZIONI\nCONOSCENZA APPROFONDITA DI INFORMATION GRAPHICS E DIGITAL VISUALIZATION\n\nCAPACITÀ DI APPLICARE CONOSCENZA E COMPRENSIONE\nGLI STUDENTI SARANNO IN GRADO DI:\nUTILIZZARE STRUMENTI DI MODELLAZIONE\nVALUTARE LA QUALITÀ DI UNA RAPPRESENTAZIONE VISUALE DI INFORMAZIONI",
                "Prerequisiti": "CONCETTI GENERALI DI ANALISI MATEMATICA. PROGRAMMAZIONE IN C O C++. NOZIONI DI BASE DI ALGEBRA LINEARE (MATRICI), E FISICA (ELEMENTI DI OTTICA GEOMETRICA E CINEMATICA) SONO PREFERIBILI, MA NON COSTITUISCONO UN REQUISITO FONDAMENTALE. LA FAMILIARITÀ CON APPLICAZIONI PER LA MODELLAZIONE E ANIMAZIONE 3D, FOTORITOCCO DIGITALE, EDITING VIDEO, O VIDEOGAMES, È UTILE PER UNA MIGLIORE FRUIZIONE DEL CORSO.",
                "Contenuti": "FONDAMENTI DI COMPUTER GRAFICA (SPAZIO 2.5 E 3D, PRIMITIVE GEOMETRICHE, TRASFORMAZIONI) (2 ORE)\nCENNI SULLA PERCEZIONE (2 ORE)\nSTEREOSCOPIA (2 ORE)\nREALTÀ AUMENTATA (2 ORE)\nVISUALIZZAZIONE DI INFORMAZIONI QUANTITATIVE (6 ORE)\nANALISI E PROGETTAZIONE DI RAPPRESENTAZIONI VISUALI (8 ORE)\nUNITY3D E LE APPLICAZIONI DI REALTÀ AUMENTATA (8 ORE)\nUNITY3D E MLAGENTS (8 H)\nSEMINARI DI APPROFONDIMENTO (10 ORE)",
                "Metodi Didattici": "•LEZIONI FRONTALI\n•ESERCITAZIONI",
                "Verifica dell'apprendimento": "IL RAGGIUNGIMENTO DEGLI OBIETTIVI DELL’INSEGNAMENTO È CERTIFICATO MEDIANTE IL SUPERAMENTO DI UN ESAME CON VALUTAZIONE IN TRENTESIMI. L'ESAME PREVEDE LO SVILUPPO DI UN PROGETTO E UNA PROVA ORALE. \n\nLO SVILUPPO DEL PROGETTO È PROPEDEUTICO ALLA PROVA ORALE E CONSISTE IN UNA APPLICAZIONE DI REALTÀ AUMENTATA CON L’AMBIENTE UNITY. LO SVILUPPO DEL PROGETTO AVVIENE DURANTE LO SVOLGIMENTO DEL CORSO. \n\nLA PROVA ORALE CONSISTE IN UN COLLOQUIO CON DOMANDE E DISCUSSIONE SUI CONTENUTI TEORICI E METODOLOGICI INDICATI NEL PROGRAMMA DELL’INSEGNAMENTO ED È FINALIZZATA AD ACCERTARE IL LIVELLO DI CONOSCENZA E CAPACITÀ DI COMPRENSIONE RAGGIUNTO DALLO STUDENTE, NONCHÉ A VERIFICARE LA CAPACITÀ DI ESPOSIZIONE RICORRENDO ALLA TERMINOLOGIA APPROPRIATA E LA CAPACITÀ DI ORGANIZZAZIONE AUTONOMA DELL'ESPOSIZIONE SUGLI STESSI ARGOMENTI A CONTENUTO TEORICO.",
                "Testi": "DISPENSE DEL CORSO (A CURA DEL DOCENTE): DISPONIBILI ONLINE\nFOLEY, VAN DAM, FEINER, HUGHES “COMPUTER GRAPHICS – PRINCIPLES AND PRACTICE”, ADDISON WESLEY\n“THE VISUAL DISPLAY OF QUANTITATIVE INFORMATION” (2ND EDITION), E. TUFTE, GRAPHICS PRESS, 2001\n\"VISUALIZATION ANALYSIS AND DESIGN\", TAMARA MUNZNER, A K PETERS VISUALIZATION SERIES, CRC PRESS",
                "Altre Informazioni": "INDIRIZZO DI POSTA ELETTRONICA DEL DOCENTE: ABATE@UNISA.IT \nINDIRIZZO DEL SITO WEB DEL DOCENTE: HTTP://DOCENTI.UNISA.IT/ANDREAFRANCESCO.ABATE"
            },
            "orari_lezioni_link": "https://docenti.unisa.it/004620/didattica/orari?include=attivita&attivita=EC2023*N0*N0*S1*S1*76301*511681"
        },
        {
            "name": "SISTEMI OPERATIVI",
            "code": "cod. 0512100006",
            "details_link": "https://docenti.unisa.it/004620/didattica?anno=2023&id=505293",
            "scheda": {
                "Obiettivi": "CONOSCENZA E CAPACITÀ DI COMPRENSIONE\n\n- VISIONE STRUTTURATA ED ORGANICA DI UN MODERNO SISTEMA OPERATIVO\n- COMPRENSIONE DELLE PRINCIPALI SCELTE IMPLEMENTATIVE E DEI MECCANISMI ALLA BASE DELLA GESTIONE DI UN SISTEMA INFORMATIVO\n- DESCRIZIONE DELL’INTERFACCIA ED IMPLEMENTAZIONE DI UN FILE SYSTEM\n- DEFINIZIONE DELLA STRUTTURA DEI PROCESSI, DEGLI ALGORITMI DI SCHEDULING PER OTTIMIZZARE L’USO DELLA CPU E DELLA SINCRONIZZAZIONE PER LA GESTIONE DELLE RISORSE CONDIVISE\n- GESTIONE DELLA MEMORIA CENTRALE\n- SISTEMA OPERATIVO LINUX (UNIX) CON LE PRINCIPALI SYSTEM CALL ED UTILIZZO DEI COMANDI DELLA SHELL\n\n\nCAPACITÀ DI APPLICARE CONOSCENZA E COMPRENSIONE\n\n- USARE, CONFIGURARE ED AMMINISTRARE UN SISTEMA OPERATIVO\n- PROGETTARE ED IMPLEMENTARE SEMPLICI FUNZIONI DI SISTEMA\n- VALUTARE, IN TERMINI DI RISORSE, IL COSTO DEI DIVERSI SERVIZI OFFERTI DAL SISTEMA OTTIMIZZANDO L’USO DELLE RISORSE DISPONIBILI\n- INDIVIDUARE SOLUZIONI OTTIMALI VALUTANDONE AUTONOMAMENTE L’EFFICIENZA E LA CORRETTEZZA FORMALE",
                "Prerequisiti": "LO STUDENTE DEVE CONOSCERE LA ARCHITETTURA DI UN SISTEMA DI ELABORAZIONE ED IL LINGUAGGIO DI PROGRAMMAZIONE C.",
                "Contenuti": "IL CORSO È COSTITUITO DA 48 ORE DI LEZIONI FRONTALI E 24 ORE DI LABORATORIO. I CONTENUTI PREVISTI SONO DESCRITTI DI SEGUITO:\n\n1) CONCETTI INTRODUTTIVI RIGUARDANTI L’ORGANIZZAZIONE, LA STRUTTURA E LE OPERAZIONI DI UN SISTEMA OPERATIVO, NONCHÉ LA GESTIONE DEI PROCESSI E DELLA MEMORIA [2 ORE FRONTALI]\n\n2) ELEMENTI INTRODUTTIVI DEL SISTEMA OPERATIVO LINUX: INSTALLAZIONE E COMANDI BASE DI BASH [4 ORE LABORATORIO]\n\n3) STRUTTURA DEI SISTEMI OPERATIVI: SERVIZI, INTERFACCIA UTENTE, CHIAMATE DI SISTEMA, TIPI DI CHIAMATE E PROGRAMMI DI SISTEMA [2 ORE FRONTALI]\n\n4) INTERFACCIA DEL FILE SYSTEM: CONCETTO DI FILE, METODI DI ACCESSO, STRUTTURA DELLE DIRECTORY, MONTAGGIO DI UN FILE SYSTEM, METODI DI ALLOCAZIONE DEI BLOCCHI, GESTIONE DELLO SPAZIO LIBERO [8 ORE FRONTALI]\n\n5) IMPLEMENTAZIONE DEL FILE SYSTEM: STRUTTURA DI UN FS, IMPLEMENTAZIONE DI UN FS E DI DIRECTORY [8 ORE FRONTALI]\n\n6) I/O SU FILE: FILE DESCRIPTOR, STANDARD FILE, OPERAZIONI SU FILE, FILE TABLE, CONDIVISIONE DI FILE, OPERAZIONI ATOMICHE, I/O BUFFERIZZATO [4 ORE LABORATORIO]\n\n7) FILE E DIRECTORY: TIPI DI FILE, STRUTTURA STAT, REAL ED EFFECTIVE USER ID, PERMESSI DI ACCESSO, LINK [6 ORE LABORATORIO]\n\n8) PROCESSI: CONCETTO DI PROCESSO, ISOLAMENTO, SCHEDULING, OPERAZIONI SUI PROCESSI, PID, FORK, WAIT, EXIT, AMBIENTE E VARIABILI DI AMBIENTE, CONDIVISIONE DI FILE, FUNZIONI EXEC [4 ORE FRONTALI + 4 ORE LABORATORIO]\n\n9) SCHEDULING: CONCETTI DI BASE, CRITERI, ALGORITMI DI SCHEDULING, ESEMPI [4 ORE FRONTALI]\n\n10) COMUNICAZIONE TRA PROCESSI: LE PIPE() DI UNIX, FIFO DI UNIX [4 ORE LABORATORIO]\n\n11) INTRODUZIONE DEL CONCETTO DI THREAD: THREAD A LIVELLO UTENTE E A LIVELLO KERNEL, LA LIBRERIA PTHREAD [2 ORE FRONTALI]\n\n12) SINCRONIZZAZIONE TRA PROCESSI: IL PROBLEMA DELLA REGIONE CRITICA, L’ALGORITMO DI PETERSON, SEMAFORI [6 ORE FRONTALI]\n\n13) GESTIONE DELLA MEMORIA: BACKGROUND, SWAPPING, ALLOCAZIONE CONTIGUA, PAGINAZIONE, STRUTTURA DELLA TABELLA DELLE PAGINE [8 ORE FRONTALI]\n\n14) MEMORIA VIRTUALE: BACKGROUND, PAGINAZIONE SU RICHIESTA, COPIA IN SCRITTURA, SOSTITUZIONE DELLE PAGINE, ALLOCAZIONE DEI FRAME, THRASHING [4 ORE FRONTALI]\n\n15) SEGNALI: CONCETTO, TIPI ED USO DEI SEGNALI\n[2 ORE LABORATORIO]",
                "Metodi Didattici": "IL CORSO DI SISTEMI OPERATIVI PREVEDE:\n• UNA PARTE DI LEZIONI DI CARATTERE TEORICO (48 ORE) PER IL TRASFERIMENTO DELLE CONOSCENZE RELATIVE ALLA STRUTTURA DI UN SISTEMA OPERATIVO IN GENERALE ED A QUELLA DI SISTEMA LINUX (EREDE DI UNIX) IN PARTICOLARE\n• IN PARALLELO SARANNO CONDOTTE ATTIVITÀ PRATICHE (24 ORE IN LABORATORIO PER ESERCIZI DI PROGRAMMAZIONE) DURANTE LE QUALI LO STUDENTE APPRENDERÀ L’UTILIZZO DELLE PRINCIPALI SYSTEM CALL DEL SISTEMA LINUX SCRIVENDO SEMPLICI APPLICAZIONI SOFTWARE DIMOSTRATIVE UTILIZZANDO IL LINGUAGGIO DI PROGRAMMAZIONE C",
                "Verifica dell'apprendimento": "L’ESAME CHE CIASCUNO STUDENTE DOVRÀ SOSTENERE POTRÀ SEGUIRE DUE MODALITÀ ALTERNATIVE:\n1. UNA PROVA SCRITTA E, PREVIA IL SUPERAMENTO DELLA STESSA, UNA PROVA ORALE CON CONTESTUALE VERIFICA DELLE COMPETENZE ACQUISITE.\nLA PROVA SCRITTA PREVEDERÀ UN INSIEME DI DOMANDE ATTE A VERIFICARE LA CONOSCENZA DEI PRINCIPALI MODULI DI UN SISTEMA OPERATIVO E L’ORGANIZZAZIONE DEGLI STESSI. AL FINE DI VERIFICARE LA CONOSCENZA DELLE FUNZIONI DEL SISTEMA OPERATIVO ED IL LORO CORRETTO UTILIZZO PER LA SOLUZIONE DI UN PROBLEMA CONCRETO, ALMENO UNO DEI QUESITI DELLA PROVA SCRITTA RICHIEDERÀ LA SCRITTURA DI UN PROGRAMMA IN LINGUAGGIO C BASATO SULL’UTILIZZO DELLE SYSTEM CALL DEL SISTEMA LINUX. \n2. OPPURE DUE VERIFICHE INTERCORSO CIASCUNA CONSISTENTE DI UNA PROVA SVOLTA CON MODALITÀ ANALOGHE ALLA PROVA SCRITTA MA RELATIVA AD ARGOMENTI AFFRONTATI NEL PERIODO DI CORSO CORRISPONDENTE.\nGLI STUDENTI POTRANNO SCEGLIERE SE EFFETTUARE TUTTE LE VERIFICHE INTERCORSO E REGISTRARE IL VOTO FINALE O SOSTENERE L’ESAME TRADIZIONALE. GLI STUDENTI CHE NON HANNO SUPERATO LE VERIFICHE INTERCORSO POTRANNO COMUNQUE SOSTENERE L’ESAME TRADIZIONALE.\nIL LIVELLO DI VALUTAZIONE DELLE PROVE TIENE CONTO DELLA COMPLETEZZA ED ESATTEZZA DELLE RISPOSTE, NONCHÉ DELLA CHIAREZZA NELLA PRESENTAZIONE.\n\nIL LIVELLO DI VALUTAZIONE MINIMO (18) È ATTRIBUITO QUANDO LO STUDENTE DIMOSTRA INCERTEZZE NELL’APPLICAZIONE DEI METODI STUDIATI E HA UNA LIMITATA CONOSCENZA DELLA STRUTTURA E DELLA ORGANIZZAZIONE DI UN SISTEMA OPERATIVO.\nIL LIVELLO MASSIMO (30) È ATTRIBUITO QUANDO LO STUDENTE DIMOSTRA UNA CONOSCENZA COMPLETA ED APPROFONDITA DEI CONCETTI E DEI DIVERSI MODULI DI UN SISTEMA OPERATIVO. INOLTRE È IN GRADO DI RISOLVERE I PROBLEMI PROPOSTI PERVENENDO IN MODO EFFICIENTE ED ACCURATO ALLA SOLUZIONE E MOSTRA UNA NOTEVOLE CAPACITÀ DI COLLEGARE TRA LORO CONCETTI DIVERSI.\nLA LODE VIENE ATTRIBUITA QUANDO IL CANDIDATO DIMOSTRA SIGNIFICATIVA PADRONANZA DEI CONTENUTI TEORICI ED OPERATIVI E MOSTRA DI SAPER PRESENTARE GLI ARGOMENTI CON NOTEVOLE PROPRIETÀ DI LINGUAGGIO E CAPACITÀ DI ELABORAZIONE AUTONOMA ANCHE IN CONTESTI DIVERSI DA QUELLI PROPOSTI DAL DOCENTE.",
                "Testi": "A. SILBERSCHATZ, P.B. GALVIN, G.GAGNE: SISTEMI OPERATIVI: CONCETTI ED ESEMPI. 10A EDIZIONE. PEARSON EDUCATION ITALIA, 2019, ISBN: 9788891904553\n\nW.R. STEVENS, S.A. RAGO, “ADVANCED PROGRAMMING IN THE UNIX ENVIRONMENT”, ADDISON-WESLEY, ISBN: 9780321637734\n\nTESTI CONSIGLIATI\nC. NEWHAM, B. ROSENBLATT, “LEARNING THE BASH SHELL”, O'REILLY, ISBN: 0-596-00965-8 \n\nSOFTWARE / HARDWARE:\nSISTEMA OPERATIVO: LINUX\nPC CON COLLEGAMENTO IN RETE",
                "Altre Informazioni": "LA FREQUENZA DEL CORSO, SEPPURE NON OBBLIGATORIA, È VIVAMENTE CONSIGLIATA SIA PER LE LEZIONI FRONTALI CHE PER LE ESERCITAZIONI IN LABORATORIO. PER LE CARATTERISTICHE DEL CORSO È NECESSARIO ACQUISIRE UNA SUFFICIENTE ABILITÀ CON LA PROGRAMMAZIONE DI SISTEMA IN LINGUAGGIO C (SCRITTURA DEL CODICE, COMPILAZIONE, DEBUGGING ED ESECUZIONE). PERTANTO È AUSPICABILE CHE LO STUDENTE TRASCORRA IL NUMERO NECESSARIO DI ORE NEI LABORATORI DIDATTICI NON ASSISTITI AL FINE DI EVIDENZIARE E COLMARE EVENTUALI DEFICIT FORMATIVI.\n\nE-MAILS:\nARESCIGNO@UNISA.IT \nABATE@UNISA.IT"
            },
            "orari_lezioni_link": "https://docenti.unisa.it/004620/didattica/orari?include=attivita&attivita=EC2023*MODULO_3*RESTO_0*S1*S1*71964*505293"
        }
    ],
    "url": "https://docenti.unisa.it/004620/home",
    "url_immagine_professore": "https://docenti.unisa.it/uploads/rescue/foto/004620.jpg",
    "error": false
}]